# Объект-игрушка
# int
from_age = 0  # с какого возраста играть

# str
material = str()  # основной материал изготовления
kind = str()  # вид игрушки (кукла, машина, и т.д.)

# float
weight = 0.0  # вес игрушки

# bool
for_boys = True  # для мальчиков
for_few = False  # для нескольких играющих
board_game = False  # настольная игра

print("С какого возраста играть, переменная типа-", type(from_age))
print("Материал игрушки, переменная типа-", type(material))
print("Вид игрушки, переменная типа-", type(kind))
print("Вес игрушки, переменная типа-", type(weight))
print("Игрушка для мальчиков, переменная типа-", type(for_boys))
print("Игрушка для нескольких играющих, переменная типа-", type(for_few))
print("Настольная игра, переменная типа-", type(board_game))
